export const mockCategories = {
  data: [
    {
      uuid: '01990380-d6a2-73d7-8b10-cde6cd0ea188',
      name: 'Вакуумные пакеты',
      slug: 'vakuumnye-pakety',
      description: [],
      image_url:
        'https://api.aspros.ru/storage/9/conversions/bc0700a454f611ed88050c9d92c897b1_72564fb57d2711f0b7c3d8bbc19402a7-card_500x500.webp',
      min_price: '1.00',
      children: [
        {
          uuid: '01990380-d6c4-705e-89e8-4a927747884c',
          name: 'Вакуумные пакеты PET/PE металлизированные',
          slug: 'vakuumnye-pakety-petpe-metallizirovannye',
          description: [],
          image_url:
            'https://api.aspros.ru/storage/9/conversions/bc0700a454f611ed88050c9d92c897b1_72564fb57d2711f0b7c3d8bbc19402a7-card_500x500.webp',
          min_price: '2.55',
          products: [
            {
              uuid: '01990380-e734-72e3-be9b-3a8794ae7b26',
              name: 'Вакуумный пакет 160*250мм 65мкм серебряный/серебряный PET/PE  (100/3000шт.)',
              description:
                'Металлизированные вакуумные пакеты PET/PE – это современная упаковка с улучшенными барьерными свойствами, созданная для длительного сохранения свежести и качества продуктов, а также для премиальной упаковки непищевых товаров. Cеребряный цвет придает упаковке привлекательный и презентабельный вид. \n\nПакеты изготовлены путем сварки полимерных пленок: прозрачной ПЭТ/ПЭ (прочный полиэтилентерефталата и термсвариваемый полиэтилен) и металлизированной ПЭТ/ПЭ. Металлизированная пленка имеет внутреннее и внешнее серебряное покрытие.\n\nМеталлизированные пакеты применяют для вакуумной упаковки мясных и рыбных деликатесов, нарезки сыров, для упаковки чая и кофе, орехов и подарочной продукции.\n\nУказаны внешние размеры пакетов с учетом боковых швов.\nГладкие вакуумные пакеты вакуумируются с помощью камерных вакуумных аппаратов.',
              slug: 'vakuumnyi-paket-160250mm-65mkm-serebrianyiserebrianyi-petpe-1003000st',
              article: 'НФ-10560',
              category_uuid: '01990380-d6c4-705e-89e8-4a927747884c',
            },
            {
              uuid: '01990380-ec9c-71f5-8ff1-9e58008e821d',
              name: 'Вакуумный пакет 200*300мм 65мкм серебряный/прозрачный PET/PE  (100/2000шт.)',
              description:
                'Металлизированные вакуумные пакеты PET/PE – это современная упаковка с улучшенными барьерными свойствами, созданная для длительного сохранения свежести и качества продуктов, а также для премиальной упаковки непищевых товаров. \n\nПакеты изготовлены путем сварки полимерных пленок: прозрачной ПЭТ/ПЭ (прочный полиэтилентерефталата и термсвариваемый полиэтилен) и металлизированной ПЭТ/ПЭ. Металлизированная пленка имеет внутреннее и внешнее серебряное покрытие.\nПрозрачная сторона пакета позволяет визуально оценить содержимое, а серебряный цвет придает упаковке привлекательный и презентабельный вид. \n\nМеталлизированные пакеты применяют для вакуумной упаковки мясных и рыбных деликатесов, нарезки сыров, для упаковки чая и кофе, орехов и подарочной продукции.\n\nУказаны внешние размеры пакетов с учетом боковых швов.\nГладкие вакуумные пакеты вакуумируются с помощью камерных вакуумных аппаратов.\n\n',
              slug: 'vakuumnyi-paket-200300mm-65mkm-serebrianyiprozracnyi-petpe-1002000st',
              article: 'НФ-12761',
              category_uuid: '01990380-d6c4-705e-89e8-4a927747884c',
            },
          ],
          children: null,
        },
      ],
    },
  ],
};

export const mockProducts = {
  data: [
    {
      uuid: '01990381-2948-7120-b5f6-cd19405a6996',
      name: 'Лента силиконизированная для курьерских пакетов 20мм*5000м 23мкм серебро PET (9 шт./кор.)',
      description:
        '\nСиликонизированная антиадгезионная лента предназначена для защиты клеевого слоя, нанесённого на клапан курьерского пакета. Она предотвращает случайное склеивание до момента использования, обеспечивая удобство и сохранность упаковки. Легко отрывается от защищаемого клеевого слоя, не нарушая его адгезионных свойств.\n\nЛента подходит для бумажных, картонных и полиэтиленовых пакетов. ',
      slug: 'lenta-silikonizirovannaia-dlia-kurerskix-paketov-20mm5000m-23mkm-serebro-pet-9-stkor',
      category_uuid: '01990380-d729-717c-800d-eff0ea221956',
      offers_min_price: '0.00',
      offers: [
        {
          uuid: '476fa736-6155-11f0-b7c2-d8bbc19402a7',
          price: '0.00',
          currency: 'RUB',
          unit: 'м',
          quantity: 1296469,
        },
      ],
      ['Мин. покупка, шт.']: '9',
      article: 'НФ-19558',
      in_cart: false,
      images: [],
      properties: {},
    },
    {
      uuid: '01990380-d79f-73b5-8eb5-f6a12bdd76c4',
      name: 'Вакуумный пакет 100*150мм 65мкм PET/PE (100/8000шт.)',
      description:
        'Вакуумные пакеты PET/PE (ПЭТ/ПЭ) производятся из многослойной комбинированной пленки, состоящей из полиэтилентерефталата (PET) и полиэтилена (PE). Такая упаковка идеально подходит для длительного сохранения свежести качества пищевых продуктов, увеличивая срок хранения в 2-3 раза. Они обладают средними барьерными свойствами, а также отличной термосвариваемостью. \n\nВакуумная упаковка широко используются для упаковки многих видов продуктов, включая мясо, рыбу, сыр, фрукты, овощи, замороженные продукты и полуфабрикаты, морепродукты, рыбные и мясные деликатесы, сухофрукты, готовые блюда и т. д. \n\nВ вакуумные пакеты упаковывают товары для продажи на маркетплейсах. Они позволяют уменьшить объем товара, тем самым сэкономить расходы на хранение и логистику. В них упаковывают пряжу, текстильные изделия, мягкие игрушки и другие объемные товары. \n\nУказаны внешние размеры пакетов с учетом боковых швов. Гладкие вакуумные пакеты вакуумируются с помощью камерных вакуумных аппаратов.',
      slug: 'vakuumnyi-paket-100150mm-65mkm-petpe-1008000st',
      category_uuid: '01990380-d6ba-73fe-903f-49294329e41b',
      offers_min_price: '1.00',
      offers: [
        {
          uuid: '29eb432e-5a08-11ea-8254-902b34bc8cee',
          price: '1.00',
          currency: 'RUB',
          unit: 'шт.',
          quantity: 140995,
        },
      ],
      ['Наличие']: 'Да в наличии',
      ['Мин. покупка, шт.']: '8000',
      article: 'НФ-05647',
      in_cart: false,
      images: [
        {
          original_url:
            'https://api.aspros.ru/storage/319/29eb432e5a0811ea8254902b34bc8cee_18fdd1936ecf11f0b7c3d8bbc19402a7.png',
          card_url:
            'https://api.aspros.ru/storage/319/conversions/29eb432e5a0811ea8254902b34bc8cee_18fdd1936ecf11f0b7c3d8bbc19402a7-card_500x500.webp',
        },
        {
          original_url:
            'https://api.aspros.ru/storage/318/29eb432e5a0811ea8254902b34bc8cee_18fdd13a6ecf11f0b7c3d8bbc19402a7.png',
          card_url:
            'https://api.aspros.ru/storage/318/conversions/29eb432e5a0811ea8254902b34bc8cee_18fdd13a6ecf11f0b7c3d8bbc19402a7-card_500x500.webp',
        },
        {
          original_url:
            'https://api.aspros.ru/storage/320/29eb432e5a0811ea8254902b34bc8cee_18fdd1ec6ecf11f0b7c3d8bbc19402a7.png',
          card_url:
            'https://api.aspros.ru/storage/320/conversions/29eb432e5a0811ea8254902b34bc8cee_18fdd1ec6ecf11f0b7c3d8bbc19402a7-card_500x500.webp',
        },
      ],
      properties: {},
    },
    {
      uuid: '01990380-d79f-73b5-8eb5-f6a12bdd76c4',
      name: 'Вакуумный пакет 100*150мм 65мкм PET/PE (100/8000шт.)',
      description:
        'Вакуумные пакеты PET/PE (ПЭТ/ПЭ) производятся из многослойной комбинированной пленки, состоящей из полиэтилентерефталата (PET) и полиэтилена (PE). Такая упаковка идеально подходит для длительного сохранения свежести качества пищевых продуктов, увеличивая срок хранения в 2-3 раза. Они обладают средними барьерными свойствами, а также отличной термосвариваемостью. \n\nВакуумная упаковка широко используются для упаковки многих видов продуктов, включая мясо, рыбу, сыр, фрукты, овощи, замороженные продукты и полуфабрикаты, морепродукты, рыбные и мясные деликатесы, сухофрукты, готовые блюда и т. д. \n\nВ вакуумные пакеты упаковывают товары для продажи на маркетплейсах. Они позволяют уменьшить объем товара, тем самым сэкономить расходы на хранение и логистику. В них упаковывают пряжу, текстильные изделия, мягкие игрушки и другие объемные товары. \n\nУказаны внешние размеры пакетов с учетом боковых швов. Гладкие вакуумные пакеты вакуумируются с помощью камерных вакуумных аппаратов.',
      slug: 'vakuumnyi-paket-100150mm-65mkm-petpe-1008000st',
      category_uuid: '01990380-d6ba-73fe-903f-49294329e41b',
      offers_min_price: '1.00',
      offers: [
        {
          uuid: '29eb432e-5a08-11ea-8254-902b34bc8cee',
          price: '1.00',
          currency: 'RUB',
          unit: 'шт.',
          quantity: 140995,
        },
      ],
      ['Наличие']: 'Да в наличии',
      ['Мин. покупка, шт.']: '8000',
      article: 'НФ-05647',
      in_cart: false,
      images: [
        {
          original_url:
            'https://api.aspros.ru/storage/319/29eb432e5a0811ea8254902b34bc8cee_18fdd1936ecf11f0b7c3d8bbc19402a7.png',
          card_url:
            'https://api.aspros.ru/storage/319/conversions/29eb432e5a0811ea8254902b34bc8cee_18fdd1936ecf11f0b7c3d8bbc19402a7-card_500x500.webp',
        },
        {
          original_url:
            'https://api.aspros.ru/storage/318/29eb432e5a0811ea8254902b34bc8cee_18fdd13a6ecf11f0b7c3d8bbc19402a7.png',
          card_url:
            'https://api.aspros.ru/storage/318/conversions/29eb432e5a0811ea8254902b34bc8cee_18fdd13a6ecf11f0b7c3d8bbc19402a7-card_500x500.webp',
        },
        {
          original_url:
            'https://api.aspros.ru/storage/320/29eb432e5a0811ea8254902b34bc8cee_18fdd1ec6ecf11f0b7c3d8bbc19402a7.png',
          card_url:
            'https://api.aspros.ru/storage/320/conversions/29eb432e5a0811ea8254902b34bc8cee_18fdd1ec6ecf11f0b7c3d8bbc19402a7-card_500x500.webp',
        },
      ],
      properties: {},
    },
    {
      uuid: '01990380-d79f-73b5-8eb5-f6a12bdd76c4',
      name: 'Вакуумный пакет 100*150мм 65мкм PET/PE (100/8000шт.)',
      description:
        'Вакуумные пакеты PET/PE (ПЭТ/ПЭ) производятся из многослойной комбинированной пленки, состоящей из полиэтилентерефталата (PET) и полиэтилена (PE). Такая упаковка идеально подходит для длительного сохранения свежести качества пищевых продуктов, увеличивая срок хранения в 2-3 раза. Они обладают средними барьерными свойствами, а также отличной термосвариваемостью. \n\nВакуумная упаковка широко используются для упаковки многих видов продуктов, включая мясо, рыбу, сыр, фрукты, овощи, замороженные продукты и полуфабрикаты, морепродукты, рыбные и мясные деликатесы, сухофрукты, готовые блюда и т. д. \n\nВ вакуумные пакеты упаковывают товары для продажи на маркетплейсах. Они позволяют уменьшить объем товара, тем самым сэкономить расходы на хранение и логистику. В них упаковывают пряжу, текстильные изделия, мягкие игрушки и другие объемные товары. \n\nУказаны внешние размеры пакетов с учетом боковых швов. Гладкие вакуумные пакеты вакуумируются с помощью камерных вакуумных аппаратов.',
      slug: 'vakuumnyi-paket-100150mm-65mkm-petpe-1008000st',
      category_uuid: '01990380-d6ba-73fe-903f-49294329e41b',
      offers_min_price: '1.00',
      offers: [
        {
          uuid: '29eb432e-5a08-11ea-8254-902b34bc8cee',
          price: '1.00',
          currency: 'RUB',
          unit: 'шт.',
          quantity: 140995,
        },
      ],
      ['Наличие']: 'Да в наличии',
      ['Мин. покупка, шт.']: '8000',
      article: 'НФ-05647',
      in_cart: false,
      images: [
        {
          original_url:
            'https://api.aspros.ru/storage/319/29eb432e5a0811ea8254902b34bc8cee_18fdd1936ecf11f0b7c3d8bbc19402a7.png',
          card_url:
            'https://api.aspros.ru/storage/319/conversions/29eb432e5a0811ea8254902b34bc8cee_18fdd1936ecf11f0b7c3d8bbc19402a7-card_500x500.webp',
        },
        {
          original_url:
            'https://api.aspros.ru/storage/318/29eb432e5a0811ea8254902b34bc8cee_18fdd13a6ecf11f0b7c3d8bbc19402a7.png',
          card_url:
            'https://api.aspros.ru/storage/318/conversions/29eb432e5a0811ea8254902b34bc8cee_18fdd13a6ecf11f0b7c3d8bbc19402a7-card_500x500.webp',
        },
        {
          original_url:
            'https://api.aspros.ru/storage/320/29eb432e5a0811ea8254902b34bc8cee_18fdd1ec6ecf11f0b7c3d8bbc19402a7.png',
          card_url:
            'https://api.aspros.ru/storage/320/conversions/29eb432e5a0811ea8254902b34bc8cee_18fdd1ec6ecf11f0b7c3d8bbc19402a7-card_500x500.webp',
        },
      ],
      properties: {},
    },
  ],
  meta: {
    total: 128,
    current_page: 1,
    last_page: 8,
    per_page: 16,
    cached_at: '2025-10-03T13:28:08.073611Z',
  },
};
